## Staging: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 2 to change, 3 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.wordpress_service will be updated in-place
  ~ resource "aws_ecs_service" "wordpress_service" {
        id                                 = "arn:aws:ecs:ca-central-1:729164266357:service/wordpress/wordpress"
        name                               = "wordpress"
        tags                               = {
            "CostCentre" = "PlatformGCArticles"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:729164266357:task-definition/wordpress:154" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.wordpress_task must be replaced
-/+ resource "aws_ecs_task_definition" "wordpress_task" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:729164266357:task-definition/wordpress:154" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  - environment      = [] -> null
                  - mountPoints      = [] -> null
                    # (6 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  - cpu              = 0 -> null
                  - mountPoints      = [] -> null
                  ~ secrets          = [
                        # (22 unchanged elements hidden)
                        {
                            name      = "WORDPRESS_NONCE_SALT"
                            valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_salt_9tv4ch-rfqWnb"
                        },
                      - {
                          - name      = "ZENDESK_API_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:zendesk_api_url_9tv4ch-nz6vdy"
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (6 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "wordpress" -> (known after apply)
      ~ revision                 = 154 -> (known after apply)
        tags                     = {
            "CostCentre" = "PlatformGCArticles"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_iam_policy.wordpress_ecs_task_get_secret_value will be updated in-place
  ~ resource "aws_iam_policy" "wordpress_ecs_task_get_secret_value" {
        id        = "arn:aws:iam::729164266357:policy/WordpressEcsTaskGetSecretValue"
        name      = "WordpressEcsTaskGetSecretValue"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:zendesk_api_url_9tv4ch-nz6vdy",
                            "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wpml_site_key_9tv4ch-s4uv3Z",
                            # (22 unchanged elements hidden)
                        ]
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.zendesk_api_url will be destroyed
  - resource "aws_secretsmanager_secret" "zendesk_api_url" {
      - arn                            = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:zendesk_api_url_9tv4ch-nz6vdy" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:zendesk_api_url_9tv4ch-nz6vdy" -> null
      - name                           = "zendesk_api_url_9tv4ch" -> null
      - recovery_window_in_days        = 30 -> null
      - rotation_enabled               = false -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
    }

  # aws_secretsmanager_secret_version.zendesk_api_url will be destroyed
  - resource "aws_secretsmanager_secret_version" "zendesk_api_url" {
      - arn            = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:zendesk_api_url_9tv4ch-nz6vdy" -> null
      - id             = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:zendesk_api_url_9tv4ch-nz6vdy|AEC52A5D-9DF7-441F-B126-3C8809DBD052" -> null
      - secret_id      = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:zendesk_api_url_9tv4ch-nz6vdy" -> null
      - secret_string  = (sensitive value)
      - version_id     = "AEC52A5D-9DF7-441F-B126-3C8809DBD052" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

Plan: 1 to add, 2 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>